podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MKL25Z4.h
/**
 * @file      PinMapping.h
 * @version   1.0.0
 * @brief     Pin declarations for MKL25Z4
 */

#ifndef PINMAPPING_H_
#define PINMAPPING_H_

#include "derivative.h"

//-------- <<< Use Configuration Wizard in Context Menu >>> -----------------  

// <h> TPM Clock settings

// TPM_SC.CMOD ================================
//
//   <o> TPM_SC.CMOD Clock source 
//   <i> Selects the clock source for the TPM module. [TPM_SC.CMOD]
//     <0=> Disabled
//     <1=> Internal clock
//     <2=> External clock
//     <3=> Reserved
//     <1=> Default
// TPM_SC.PS ================================
//
//   <o1> TPM_SC.PS Clock prescaler 
//   <i> Selects the prescaler for the TPM module. [TPM_SC.PS]
//     <0=> Divide by 1
//     <1=> Divide by 2
//     <2=> Divide by 4
//     <3=> Divide by 8
//     <4=> Divide by 16
//     <5=> Divide by 32
//     <6=> Divide by 64
//     <7=> Divide by 128
//     <0=> Default
#define TPM_SC               (TPM_SC_CMOD(0x1)|TPM_SC_PS(0x0))

// </h>

#define TPM0_CLOCK_REG       SIM->SCGC6          
#define TPM0_CLOCK_MASK      SIM_SCGC6_TPM0_MASK 
#define TPM1_CLOCK_REG       SIM->SCGC6          
#define TPM1_CLOCK_MASK      SIM_SCGC6_TPM1_MASK 
#define TPM2_CLOCK_REG       SIM->SCGC6          
#define TPM2_CLOCK_MASK      SIM_SCGC6_TPM2_MASK 
#define ADC0_CLOCK_REG       SIM->SCGC6          
#define ADC0_CLOCK_MASK      SIM_SCGC6_ADC0_MASK 
#define I2C0_CLOCK_REG       SIM->SCGC4          
#define I2C0_CLOCK_MASK      SIM_SCGC4_I2C0_MASK 
#define I2C1_CLOCK_REG       SIM->SCGC4          
#define I2C1_CLOCK_MASK      SIM_SCGC4_I2C1_MASK 
#define SPI0_CLOCK_REG       SIM->SCGC4          
#define SPI0_CLOCK_MASK      SIM_SCGC4_SPI0_MASK 
#define SPI1_CLOCK_REG       SIM->SCGC4          
#define SPI1_CLOCK_MASK      SIM_SCGC4_SPI1_MASK 

// <h> Pin Peripheral mapping

// ADC0_0 maps to [Disabled, PTE20]
//   <o> ADC0_0 Pin Selection [PTE20(A11)] <constant>
//   <i> Selects which pin is used for ADC0_0
//     <0=> Disabled
//     <1=> PTE20 (Alias: A11)
//     <1=> Default
#define ADC0_0_SEL           1                   

// ADC0_11 maps to [Disabled, PTC2]
//   <o> ADC0_11 Pin Selection [PTC2(A4)] <constant>
//   <i> Selects which pin is used for ADC0_11
//     <0=> Disabled
//     <1=> PTC2 (Alias: A4)
//     <1=> Default
#define ADC0_11_SEL          1                   

// ADC0_12 maps to [Disabled, PTB2]
//   <o> ADC0_12 Pin Selection [PTB2(A2)] <constant>
//   <i> Selects which pin is used for ADC0_12
//     <0=> Disabled
//     <1=> PTB2 (Alias: A2)
//     <1=> Default
#define ADC0_12_SEL          1                   

// ADC0_13 maps to [Disabled, PTB3]
//   <o> ADC0_13 Pin Selection [PTB3(A3)] <constant>
//   <i> Selects which pin is used for ADC0_13
//     <0=> Disabled
//     <1=> PTB3 (Alias: A3)
//     <1=> Default
#define ADC0_13_SEL          1                   

// ADC0_14 maps to [Disabled, PTC0]
//   <o> ADC0_14 Pin Selection [PTC0(D17)] <constant>
//   <i> Selects which pin is used for ADC0_14
//     <0=> Disabled
//     <1=> PTC0 (Alias: D17)
//     <1=> Default
#define ADC0_14_SEL          1                   

// ADC0_15 maps to [Disabled, PTC1]
//   <o> ADC0_15 Pin Selection [PTC1(A5)] <constant>
//   <i> Selects which pin is used for ADC0_15
//     <0=> Disabled
//     <1=> PTC1 (Alias: A5)
//     <1=> Default
#define ADC0_15_SEL          1                   

// ADC0_23 maps to [Disabled, PTE30]
//   <o> ADC0_23 Pin Selection [PTE30(A6)] <constant>
//   <i> Selects which pin is used for ADC0_23
//     <0=> Disabled
//     <1=> PTE30 (Alias: A6)
//     <1=> Default
#define ADC0_23_SEL          1                   

// ADC0_3 maps to [Disabled, PTE22]
//   <o> ADC0_3 Pin Selection [PTE22(A9)] <constant>
//   <i> Selects which pin is used for ADC0_3
//     <0=> Disabled
//     <1=> PTE22 (Alias: A9)
//     <1=> Default
#define ADC0_3_SEL           1                   

// ADC0_4 maps to [Disabled, PTE29]
//   <o> ADC0_4 Pin Selection [PTE29(A7)] <constant>
//   <i> Selects which pin is used for ADC0_4
//     <0=> Disabled
//     <1=> PTE29 (Alias: A7)
//     <1=> Default
#define ADC0_4_SEL           1                   

// ADC0_5 maps to [Disabled, PTD1]
//   <o> ADC0_5 Pin Selection [PTD1(D13)] <constant>
//   <i> Selects which pin is used for ADC0_5
//     <0=> Disabled
//     <1=> PTD1 (Alias: D13)
//     <1=> Default
#define ADC0_5_SEL           1                   

// ADC0_6 maps to [Disabled, PTD5]
//   <o> ADC0_6 Pin Selection [PTD5(D9)] <constant>
//   <i> Selects which pin is used for ADC0_6
//     <0=> Disabled
//     <1=> PTD5 (Alias: D9)
//     <1=> Default
#define ADC0_6_SEL           1                   

// ADC0_7 maps to [Disabled, PTD6]
//   <o> ADC0_7 Pin Selection [PTD6(D32)] <constant>
//   <i> Selects which pin is used for ADC0_7
//     <0=> Disabled
//     <1=> PTD6 (Alias: D32)
//     <1=> Default
#define ADC0_7_SEL           1                   

// ADC0_8 maps to [Disabled, PTB0]
//   <o> ADC0_8 Pin Selection [PTB0(A0)] <constant>
//   <i> Selects which pin is used for ADC0_8
//     <0=> Disabled
//     <1=> PTB0 (Alias: A0)
//     <1=> Default
#define ADC0_8_SEL           1                   

// ADC0_9 maps to [Disabled, PTB1]
//   <o> ADC0_9 Pin Selection [PTB1(A1)] <constant>
//   <i> Selects which pin is used for ADC0_9
//     <0=> Disabled
//     <1=> PTB1 (Alias: A1)
//     <1=> Default
#define ADC0_9_SEL           1                   

// I2C0_SCL maps to [Disabled, PTB0, PTB2, PTC8, PTE24]
//   <o> I2C0_SCL Pin Selection [PTB0(A0), PTB2(A2), PTC8(D6), PTE24] 
//   <i> Selects which pin is used for I2C0_SCL
//     <0=> Disabled
//     <1=> PTB0 (Alias: A0)
//     <2=> PTB2 (Alias: A2)
//     <3=> PTC8 (Alias: D6)
//     <4=> PTE24
//     <4=> Default
#define I2C0_SCL_SEL         4                   

// I2C0_SDA maps to [Disabled, PTB1, PTB3, PTC9, PTE25]
//   <o> I2C0_SDA Pin Selection [PTB1(A1), PTB3(A3), PTC9(D7), PTE25] 
//   <i> Selects which pin is used for I2C0_SDA
//     <0=> Disabled
//     <1=> PTB1 (Alias: A1)
//     <2=> PTB3 (Alias: A3)
//     <3=> PTC9 (Alias: D7)
//     <4=> PTE25
//     <4=> Default
#define I2C0_SDA_SEL         4                   

