podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MKL25Z4.h
// I2C1_SCL maps to [Disabled, PTA3, PTC1, PTC10, PTE1]
//   <o> I2C1_SCL Pin Selection [PTA3, PTC1(A5), PTC10(D22), PTE1(D14)] 
//   <i> Selects which pin is used for I2C1_SCL
//     <0=> Disabled
//     <1=> PTA3
//     <2=> PTC1 (Alias: A5)
//     <3=> PTC10 (Alias: D22)
//     <4=> PTE1 (Alias: D14)
//     <4=> Default
#define I2C1_SCL_SEL         4                   

// I2C1_SDA maps to [Disabled, PTA4, PTC2, PTC11, PTE0]
//   <o> I2C1_SDA Pin Selection [PTA4(D4), PTC2(A4), PTC11(D23), PTE0(D15)] 
//   <i> Selects which pin is used for I2C1_SDA
//     <0=> Disabled
//     <1=> PTA4 (Alias: D4)
//     <2=> PTC2 (Alias: A4)
//     <3=> PTC11 (Alias: D23)
//     <4=> PTE0 (Alias: D15)
//     <4=> Default
#define I2C1_SDA_SEL         4                   

// SPI0_MISO maps to [Disabled, PTA16, PTA17, PTC6, PTC7, PTD2, PTD3]
//   <o> SPI0_MISO Pin Selection [PTA16(D28), PTA17(D29), PTC6(D21), PTC7(D16), PTD2(D11), PTD3(D12)] 
//   <i> Selects which pin is used for SPI0_MISO
//     <0=> Disabled
//     <1=> PTA16 (Alias: D28)
//     <2=> PTA17 (Alias: D29)
//     <3=> PTC6 (Alias: D21)
//     <4=> PTC7 (Alias: D16)
//     <5=> PTD2 (Alias: D11)
//     <6=> PTD3 (Alias: D12)
//     <6=> Default
#define SPI0_MISO_SEL        6                   

// SPI0_MOSI maps to [Disabled, PTA16, PTA17, PTC6, PTC7, PTD2, PTD3]
//   <o> SPI0_MOSI Pin Selection [PTA16(D28), PTA17(D29), PTC6(D21), PTC7(D16), PTD2(D11), PTD3(D12)] 
//   <i> Selects which pin is used for SPI0_MOSI
//     <0=> Disabled
//     <1=> PTA16 (Alias: D28)
//     <2=> PTA17 (Alias: D29)
//     <3=> PTC6 (Alias: D21)
//     <4=> PTC7 (Alias: D16)
//     <5=> PTD2 (Alias: D11)
//     <6=> PTD3 (Alias: D12)
//     <5=> Default
#define SPI0_MOSI_SEL        5                   

// SPI0_PCS0 maps to [Disabled, PTA14, PTC4, PTD0]
//   <o> SPI0_PCS0 Pin Selection [PTA14, PTC4(D19), PTD0(D10)] 
//   <i> Selects which pin is used for SPI0_PCS0
//     <0=> Disabled
//     <1=> PTA14
//     <2=> PTC4 (Alias: D19)
//     <3=> PTD0 (Alias: D10)
//     <0=> Default
#define SPI0_PCS0_SEL        0                   

// SPI0_SCK maps to [Disabled, PTA15, PTC5, PTD1]
//   <o> SPI0_SCK Pin Selection [PTA15, PTC5(D20), PTD1(D13)] 
//   <i> Selects which pin is used for SPI0_SCK
//     <0=> Disabled
//     <1=> PTA15
//     <2=> PTC5 (Alias: D20)
//     <3=> PTD1 (Alias: D13)
//     <3=> Default
#define SPI0_SCK_SEL         3                   

// SPI1_MISO maps to [Disabled, PTB16, PTB17, PTD6, PTD7, PTE1, PTE3]
//   <o> SPI1_MISO Pin Selection [PTB16, PTB17, PTD6(D32), PTD7(D33), PTE1(D14), PTE3(A15)] 
//   <i> Selects which pin is used for SPI1_MISO
//     <0=> Disabled
//     <1=> PTB16
//     <2=> PTB17
//     <3=> PTD6 (Alias: D32)
//     <4=> PTD7 (Alias: D33)
//     <5=> PTE1 (Alias: D14)
//     <6=> PTE3 (Alias: A15)
//     <1=> Default
#define SPI1_MISO_SEL        1                   

// SPI1_MOSI maps to [Disabled, PTB16, PTB17, PTD6, PTD7, PTE1, PTE3]
//   <o> SPI1_MOSI Pin Selection [PTB16, PTB17, PTD6(D32), PTD7(D33), PTE1(D14), PTE3(A15)] 
//   <i> Selects which pin is used for SPI1_MOSI
//     <0=> Disabled
//     <1=> PTB16
//     <2=> PTB17
//     <3=> PTD6 (Alias: D32)
//     <4=> PTD7 (Alias: D33)
//     <5=> PTE1 (Alias: D14)
//     <6=> PTE3 (Alias: A15)
//     <2=> Default
#define SPI1_MOSI_SEL        2                   

// SPI1_PCS0 maps to [Disabled, PTB10, PTD4, PTE4]
//   <o> SPI1_PCS0 Pin Selection [PTB10(A18), PTD4(D2), PTE4(A14)] 
//   <i> Selects which pin is used for SPI1_PCS0
//     <0=> Disabled
//     <1=> PTB10 (Alias: A18)
//     <2=> PTD4 (Alias: D2)
//     <3=> PTE4 (Alias: A14)
//     <0=> Default
#define SPI1_PCS0_SEL        0                   

// SPI1_SCK maps to [Disabled, PTB11, PTD5, PTE2]
//   <o> SPI1_SCK Pin Selection [PTB11(A17), PTD5(D9), PTE2(A16)] 
//   <i> Selects which pin is used for SPI1_SCK
//     <0=> Disabled
//     <1=> PTB11 (Alias: A17)
//     <2=> PTD5 (Alias: D9)
//     <3=> PTE2 (Alias: A16)
//     <1=> Default
#define SPI1_SCK_SEL         1                   

// TPM0_0 maps to [Disabled, PTA3, PTC1, PTD0, PTE24]
//   <o> TPM0_0 Pin Selection [PTA3, PTC1(A5), PTD0(D10), PTE24] 
//   <i> Selects which pin is used for TPM0_0
//     <0=> Disabled
//     <1=> PTA3
//     <2=> PTC1 (Alias: A5)
//     <3=> PTD0 (Alias: D10)
//     <4=> PTE24
//     <3=> Default
#define TPM0_0_SEL           3                   

// TPM0_1 maps to [Disabled, PTA4, PTC2, PTD1, PTE25]
//   <o> TPM0_1 Pin Selection [PTA4(D4), PTC2(A4), PTD1(D13), PTE25] 
//   <i> Selects which pin is used for TPM0_1
//     <0=> Disabled
//     <1=> PTA4 (Alias: D4)
//     <2=> PTC2 (Alias: A4)
//     <3=> PTD1 (Alias: D13)
//     <4=> PTE25
//     <3=> Default
#define TPM0_1_SEL           3                   

// TPM0_2 maps to [Disabled, PTA5, PTC3, PTD2, PTE29]
//   <o> TPM0_2 Pin Selection [PTA5(D5), PTC3(D18), PTD2(D11), PTE29(A7)] 
//   <i> Selects which pin is used for TPM0_2
//     <0=> Disabled
//     <1=> PTA5 (Alias: D5)
//     <2=> PTC3 (Alias: D18)
//     <3=> PTD2 (Alias: D11)
//     <4=> PTE29 (Alias: A7)
//     <1=> Default
#define TPM0_2_SEL           1                   

// TPM0_3 maps to [Disabled, PTC4, PTD3, PTE30]
//   <o> TPM0_3 Pin Selection [PTC4(D19), PTD3(D12), PTE30(A6)] 
//   <i> Selects which pin is used for TPM0_3
//     <0=> Disabled
//     <1=> PTC4 (Alias: D19)
//     <2=> PTD3 (Alias: D12)
//     <3=> PTE30 (Alias: A6)
//     <1=> Default
#define TPM0_3_SEL           1                   

// TPM0_4 maps to [Disabled, PTC8, PTD4, PTE31]
//   <o> TPM0_4 Pin Selection [PTC8(D6), PTD4(D2), PTE31(D30)] 
//   <i> Selects which pin is used for TPM0_4
//     <0=> Disabled
//     <1=> PTC8 (Alias: D6)
//     <2=> PTD4 (Alias: D2)
//     <3=> PTE31 (Alias: D30)
//     <1=> Default
#define TPM0_4_SEL           1                   

// TPM0_5 maps to [Disabled, PTA0, PTC9, PTD5]
//   <o> TPM0_5 Pin Selection [PTA0, PTC9(D7), PTD5(D9)] 
//   <i> Selects which pin is used for TPM0_5
//     <0=> Disabled
//     <1=> PTA0
//     <2=> PTC9 (Alias: D7)
//     <3=> PTD5 (Alias: D9)
//     <2=> Default
#define TPM0_5_SEL           2                   

// TPM1_0 maps to [Disabled, PTA12, PTB0, PTE20]
//   <o> TPM1_0 Pin Selection [PTA12(D3), PTB0(A0), PTE20(A11)] 
//   <i> Selects which pin is used for TPM1_0
//     <0=> Disabled
//     <1=> PTA12 (Alias: D3)
//     <2=> PTB0 (Alias: A0)
//     <3=> PTE20 (Alias: A11)
//     <1=> Default
#define TPM1_0_SEL           1                   

// TPM1_1 maps to [Disabled, PTA13, PTB1, PTE21]
//   <o> TPM1_1 Pin Selection [PTA13(D8), PTB1(A1), PTE21(A10)] 
//   <i> Selects which pin is used for TPM1_1
//     <0=> Disabled
//     <1=> PTA13 (Alias: D8)
//     <2=> PTB1 (Alias: A1)
//     <3=> PTE21 (Alias: A10)
//     <1=> Default
#define TPM1_1_SEL           1                   

// TPM2_0 maps to [Disabled, PTA1, PTB2, PTB18, PTE22]
//   <o> TPM2_0 Pin Selection [PTA1(D0), PTB2(A2), PTB18, PTE22(A9)] 
//   <i> Selects which pin is used for TPM2_0
//     <0=> Disabled
//     <1=> PTA1 (Alias: D0)
//     <2=> PTB2 (Alias: A2)
//     <3=> PTB18
//     <4=> PTE22 (Alias: A9)
//     <1=> Default
#define TPM2_0_SEL           1                   

// TPM2_1 maps to [Disabled, PTA2, PTB3, PTB19, PTE23]
//   <o> TPM2_1 Pin Selection [PTA2(D1), PTB3(A3), PTB19, PTE23(A8)] 
//   <i> Selects which pin is used for TPM2_1
//     <0=> Disabled
//     <1=> PTA2 (Alias: D1)
//     <2=> PTB3 (Alias: A3)
//     <3=> PTB19
//     <4=> PTE23 (Alias: A8)
//     <1=> Default
#define TPM2_1_SEL           1                   

// PTA0 = TPM0_5
#define PTA0_PORT                  A     //!< PTA0 Port name
#define PTA0_NUM                   0     //!< PTA0 Port number
#if TPM0_5_SEL == 1
#define PTA0_TPM_NUM               0     //!< PTA0 TPM number
#define PTA0_TPM_CH                5     //!< PTA0 TPM channel
#define PTA0_TPM_FN                3     //!< PTA0 Pin multiplexor for TPM
#endif

