podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MKL25Z4.h
// PTA1 = TPM2_0 (Alias: D0)
#define PTA1_PORT                  A     //!< PTA1 Port name
#define PTA1_NUM                   1     //!< PTA1 Port number
#if TPM2_0_SEL == 1
#define PTA1_TPM_NUM               2     //!< PTA1 TPM number
#define PTA1_TPM_CH                0     //!< PTA1 TPM channel
#define PTA1_TPM_FN                3     //!< PTA1 Pin multiplexor for TPM
#endif

// PTA2 = TPM2_1 (Alias: D1)
#define PTA2_PORT                  A     //!< PTA2 Port name
#define PTA2_NUM                   2     //!< PTA2 Port number
#if TPM2_1_SEL == 1
#define PTA2_TPM_NUM               2     //!< PTA2 TPM number
#define PTA2_TPM_CH                1     //!< PTA2 TPM channel
#define PTA2_TPM_FN                3     //!< PTA2 Pin multiplexor for TPM
#endif

// PTA3 = TPM0_0,I2C1_SCL
#define PTA3_PORT                  A     //!< PTA3 Port name
#define PTA3_NUM                   3     //!< PTA3 Port number
#if TPM0_0_SEL == 1
#define PTA3_TPM_NUM               0     //!< PTA3 TPM number
#define PTA3_TPM_CH                0     //!< PTA3 TPM channel
#define PTA3_TPM_FN                3     //!< PTA3 Pin multiplexor for TPM
#endif
#if I2C1_SCL_SEL == 1
#define I2C1_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTA3  //!< PTA3 = I2C
#endif

// PTA4 = TPM0_1,I2C1_SDA (Alias: D4)
#define PTA4_PORT                  A     //!< PTA4 Port name
#define PTA4_NUM                   4     //!< PTA4 Port number
#if TPM0_1_SEL == 1
#define PTA4_TPM_NUM               0     //!< PTA4 TPM number
#define PTA4_TPM_CH                1     //!< PTA4 TPM channel
#define PTA4_TPM_FN                3     //!< PTA4 Pin multiplexor for TPM
#endif
#if I2C1_SDA_SEL == 1
#define I2C1_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTA4  //!< PTA4 = I2C
#endif

// PTA5 = TPM0_2 (Alias: D5)
#define PTA5_PORT                  A     //!< PTA5 Port name
#define PTA5_NUM                   5     //!< PTA5 Port number
#if TPM0_2_SEL == 1
#define PTA5_TPM_NUM               0     //!< PTA5 TPM number
#define PTA5_TPM_CH                2     //!< PTA5 TPM channel
#define PTA5_TPM_FN                3     //!< PTA5 Pin multiplexor for TPM
#endif

// PTA12 = TPM1_0 (Alias: D3)
#define PTA12_PORT                 A     //!< PTA12 Port name
#define PTA12_NUM                  12    //!< PTA12 Port number
#if TPM1_0_SEL == 1
#define PTA12_TPM_NUM              1     //!< PTA12 TPM number
#define PTA12_TPM_CH               0     //!< PTA12 TPM channel
#define PTA12_TPM_FN               3     //!< PTA12 Pin multiplexor for TPM
#endif

// PTA13 = TPM1_1 (Alias: D8)
#define PTA13_PORT                 A     //!< PTA13 Port name
#define PTA13_NUM                  13    //!< PTA13 Port number
#if TPM1_1_SEL == 1
#define PTA13_TPM_NUM              1     //!< PTA13 TPM number
#define PTA13_TPM_CH               1     //!< PTA13 TPM channel
#define PTA13_TPM_FN               3     //!< PTA13 Pin multiplexor for TPM
#endif

// PTA14 = SPI0_PCS0
#define PTA14_PORT                 A     //!< PTA14 Port name
#define PTA14_NUM                  14    //!< PTA14 Port number
#if SPI0_PCS0_SEL == 1
#define SPI0_PCS0_FN               2     //!< PTA14 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTA14  //!< PTA14 = SPI
#endif

// PTA15 = SPI0_SCK
#define PTA15_PORT                 A     //!< PTA15 Port name
#define PTA15_NUM                  15    //!< PTA15 Port number
#if SPI0_SCK_SEL == 1
#define SPI0_SCK_FN                2     //!< PTA15 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTA15  //!< PTA15 = SPI
#endif

// PTA16 = SPI0_MOSI,SPI0_MISO (Alias: D28)
#define PTA16_PORT                 A     //!< PTA16 Port name
#define PTA16_NUM                  16    //!< PTA16 Port number
#if SPI0_MOSI_SEL == 1
#define SPI0_MOSI_FN               2     //!< PTA16 Pin multiplexor for SPI
#define SPI0_MOSI_GPIO             digitalIO_PTA16  //!< PTA16 = SPI
#endif
#if SPI0_MISO_SEL == 1
#define SPI0_MISO_FN               5     //!< PTA16 Pin multiplexor for SPI
#define SPI0_MISO_GPIO             digitalIO_PTA16  //!< PTA16 = SPI
#endif

// PTA17 = SPI0_MISO,SPI0_MOSI (Alias: D29)
#define PTA17_PORT                 A     //!< PTA17 Port name
#define PTA17_NUM                  17    //!< PTA17 Port number
#if SPI0_MISO_SEL == 2
#define SPI0_MISO_FN               2     //!< PTA17 Pin multiplexor for SPI
#define SPI0_MISO_GPIO             digitalIO_PTA17  //!< PTA17 = SPI
#endif
#if SPI0_MOSI_SEL == 2
#define SPI0_MOSI_FN               5     //!< PTA17 Pin multiplexor for SPI
#define SPI0_MOSI_GPIO             digitalIO_PTA17  //!< PTA17 = SPI
#endif

// PTA18
#define PTA18_PORT                 A     //!< PTA18 Port name
#define PTA18_NUM                  18    //!< PTA18 Port number

// PTA19
#define PTA19_PORT                 A     //!< PTA19 Port name
#define PTA19_NUM                  19    //!< PTA19 Port number

// PTA20
#define PTA20_PORT                 A     //!< PTA20 Port name
#define PTA20_NUM                  20    //!< PTA20 Port number

// PTB0 = ADC0_8,TPM1_0,I2C0_SCL (Alias: A0)
#define PTB0_PORT                  B     //!< PTB0 Port name
#define PTB0_NUM                   0     //!< PTB0 Port number
#define PTB0_ADC_NUM               0     //!< PTB0 ADC number
#define PTB0_ADC_CH                8     //!< PTB0 ADC channel
#if TPM1_0_SEL == 2
#define PTB0_TPM_NUM               1     //!< PTB0 TPM number
#define PTB0_TPM_CH                0     //!< PTB0 TPM channel
#define PTB0_TPM_FN                3     //!< PTB0 Pin multiplexor for TPM
#endif
#if I2C0_SCL_SEL == 1
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTB0  //!< PTB0 = I2C
#endif

// PTB1 = ADC0_9,TPM1_1,I2C0_SDA (Alias: A1)
#define PTB1_PORT                  B     //!< PTB1 Port name
#define PTB1_NUM                   1     //!< PTB1 Port number
#define PTB1_ADC_NUM               0     //!< PTB1 ADC number
#define PTB1_ADC_CH                9     //!< PTB1 ADC channel
#if TPM1_1_SEL == 2
#define PTB1_TPM_NUM               1     //!< PTB1 TPM number
#define PTB1_TPM_CH                1     //!< PTB1 TPM channel
#define PTB1_TPM_FN                3     //!< PTB1 Pin multiplexor for TPM
#endif
#if I2C0_SDA_SEL == 1
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTB1  //!< PTB1 = I2C
#endif

// PTB2 = ADC0_12,TPM2_0,I2C0_SCL (Alias: A2)
#define PTB2_PORT                  B     //!< PTB2 Port name
#define PTB2_NUM                   2     //!< PTB2 Port number
#define PTB2_ADC_NUM               0     //!< PTB2 ADC number
#define PTB2_ADC_CH                12    //!< PTB2 ADC channel
#if TPM2_0_SEL == 2
#define PTB2_TPM_NUM               2     //!< PTB2 TPM number
#define PTB2_TPM_CH                0     //!< PTB2 TPM channel
#define PTB2_TPM_FN                3     //!< PTB2 Pin multiplexor for TPM
#endif
#if I2C0_SCL_SEL == 2
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTB2  //!< PTB2 = I2C
#endif

// PTB3 = ADC0_13,TPM2_1,I2C0_SDA (Alias: A3)
#define PTB3_PORT                  B     //!< PTB3 Port name
#define PTB3_NUM                   3     //!< PTB3 Port number
#define PTB3_ADC_NUM               0     //!< PTB3 ADC number
#define PTB3_ADC_CH                13    //!< PTB3 ADC channel
#if TPM2_1_SEL == 2
#define PTB3_TPM_NUM               2     //!< PTB3 TPM number
#define PTB3_TPM_CH                1     //!< PTB3 TPM channel
#define PTB3_TPM_FN                3     //!< PTB3 Pin multiplexor for TPM
#endif
#if I2C0_SDA_SEL == 2
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTB3  //!< PTB3 = I2C
#endif

// PTB8 (Alias: A20)
#define PTB8_PORT                  B     //!< PTB8 Port name
#define PTB8_NUM                   8     //!< PTB8 Port number

// PTB9 (Alias: A19)
#define PTB9_PORT                  B     //!< PTB9 Port name
#define PTB9_NUM                   9     //!< PTB9 Port number

// PTB10 = SPI1_PCS0 (Alias: A18)
#define PTB10_PORT                 B     //!< PTB10 Port name
#define PTB10_NUM                  10    //!< PTB10 Port number
#if SPI1_PCS0_SEL == 1
#define SPI1_PCS0_FN               2     //!< PTB10 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTB10  //!< PTB10 = SPI
#endif

// PTB11 = SPI1_SCK (Alias: A17)
#define PTB11_PORT                 B     //!< PTB11 Port name
#define PTB11_NUM                  11    //!< PTB11 Port number
#if SPI1_SCK_SEL == 1
#define SPI1_SCK_FN                2     //!< PTB11 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTB11  //!< PTB11 = SPI
#endif

// PTB16 = SPI1_MOSI,SPI1_MISO
#define PTB16_PORT                 B     //!< PTB16 Port name
#define PTB16_NUM                  16    //!< PTB16 Port number
#if SPI1_MOSI_SEL == 1
#define SPI1_MOSI_FN               2     //!< PTB16 Pin multiplexor for SPI
#define SPI1_MOSI_GPIO             digitalIO_PTB16  //!< PTB16 = SPI
#endif
#if SPI1_MISO_SEL == 1
#define SPI1_MISO_FN               5     //!< PTB16 Pin multiplexor for SPI
#define SPI1_MISO_GPIO             digitalIO_PTB16  //!< PTB16 = SPI
#endif

// PTB17 = SPI1_MISO,SPI1_MOSI
#define PTB17_PORT                 B     //!< PTB17 Port name
#define PTB17_NUM                  17    //!< PTB17 Port number
#if SPI1_MISO_SEL == 2
#define SPI1_MISO_FN               2     //!< PTB17 Pin multiplexor for SPI
#define SPI1_MISO_GPIO             digitalIO_PTB17  //!< PTB17 = SPI
#endif
#if SPI1_MOSI_SEL == 2
#define SPI1_MOSI_FN               5     //!< PTB17 Pin multiplexor for SPI
#define SPI1_MOSI_GPIO             digitalIO_PTB17  //!< PTB17 = SPI
#endif

// PTB18 = TPM2_0
#define PTB18_PORT                 B     //!< PTB18 Port name
#define PTB18_NUM                  18    //!< PTB18 Port number
#if TPM2_0_SEL == 3
#define PTB18_TPM_NUM              2     //!< PTB18 TPM number
#define PTB18_TPM_CH               0     //!< PTB18 TPM channel
#define PTB18_TPM_FN               3     //!< PTB18 Pin multiplexor for TPM
#endif

// PTB19 = TPM2_1
#define PTB19_PORT                 B     //!< PTB19 Port name
#define PTB19_NUM                  19    //!< PTB19 Port number
#if TPM2_1_SEL == 3
#define PTB19_TPM_NUM              2     //!< PTB19 TPM number
#define PTB19_TPM_CH               1     //!< PTB19 TPM channel
#define PTB19_TPM_FN               3     //!< PTB19 Pin multiplexor for TPM
#endif

// PTC0 = ADC0_14 (Alias: D17)
#define PTC0_PORT                  C     //!< PTC0 Port name
#define PTC0_NUM                   0     //!< PTC0 Port number
#define PTC0_ADC_NUM               0     //!< PTC0 ADC number
#define PTC0_ADC_CH                14    //!< PTC0 ADC channel

// PTC1 = ADC0_15,TPM0_0,I2C1_SCL (Alias: A5)
#define PTC1_PORT                  C     //!< PTC1 Port name
#define PTC1_NUM                   1     //!< PTC1 Port number
#define PTC1_ADC_NUM               0     //!< PTC1 ADC number
#define PTC1_ADC_CH                15    //!< PTC1 ADC channel
#if TPM0_0_SEL == 2
#define PTC1_TPM_NUM               0     //!< PTC1 TPM number
#define PTC1_TPM_CH                0     //!< PTC1 TPM channel
#define PTC1_TPM_FN                4     //!< PTC1 Pin multiplexor for TPM
#endif
#if I2C1_SCL_SEL == 2
#define I2C1_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTC1  //!< PTC1 = I2C
#endif

