podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MKL25Z4.h
// PTC2 = ADC0_11,TPM0_1,I2C1_SDA (Alias: A4)
#define PTC2_PORT                  C     //!< PTC2 Port name
#define PTC2_NUM                   2     //!< PTC2 Port number
#define PTC2_ADC_NUM               0     //!< PTC2 ADC number
#define PTC2_ADC_CH                11    //!< PTC2 ADC channel
#if TPM0_1_SEL == 2
#define PTC2_TPM_NUM               0     //!< PTC2 TPM number
#define PTC2_TPM_CH                1     //!< PTC2 TPM channel
#define PTC2_TPM_FN                4     //!< PTC2 Pin multiplexor for TPM
#endif
#if I2C1_SDA_SEL == 2
#define I2C1_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTC2  //!< PTC2 = I2C
#endif

// PTC3 = TPM0_2 (Alias: D18)
#define PTC3_PORT                  C     //!< PTC3 Port name
#define PTC3_NUM                   3     //!< PTC3 Port number
#if TPM0_2_SEL == 2
#define PTC3_TPM_NUM               0     //!< PTC3 TPM number
#define PTC3_TPM_CH                2     //!< PTC3 TPM channel
#define PTC3_TPM_FN                4     //!< PTC3 Pin multiplexor for TPM
#endif

// PTC4 = TPM0_3,SPI0_PCS0 (Alias: D19)
#define PTC4_PORT                  C     //!< PTC4 Port name
#define PTC4_NUM                   4     //!< PTC4 Port number
#if TPM0_3_SEL == 1
#define PTC4_TPM_NUM               0     //!< PTC4 TPM number
#define PTC4_TPM_CH                3     //!< PTC4 TPM channel
#define PTC4_TPM_FN                4     //!< PTC4 Pin multiplexor for TPM
#endif
#if SPI0_PCS0_SEL == 2
#define SPI0_PCS0_FN               2     //!< PTC4 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTC4  //!< PTC4 = SPI
#endif

// PTC5 = SPI0_SCK (Alias: D20)
#define PTC5_PORT                  C     //!< PTC5 Port name
#define PTC5_NUM                   5     //!< PTC5 Port number
#if SPI0_SCK_SEL == 2
#define SPI0_SCK_FN                2     //!< PTC5 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTC5  //!< PTC5 = SPI
#endif

// PTC6 = SPI0_MOSI,SPI0_MISO (Alias: D21)
#define PTC6_PORT                  C     //!< PTC6 Port name
#define PTC6_NUM                   6     //!< PTC6 Port number
#if SPI0_MOSI_SEL == 3
#define SPI0_MOSI_FN               2     //!< PTC6 Pin multiplexor for SPI
#define SPI0_MOSI_GPIO             digitalIO_PTC6  //!< PTC6 = SPI
#endif
#if SPI0_MISO_SEL == 3
#define SPI0_MISO_FN               5     //!< PTC6 Pin multiplexor for SPI
#define SPI0_MISO_GPIO             digitalIO_PTC6  //!< PTC6 = SPI
#endif

// PTC7 = SPI0_MISO,SPI0_MOSI (Alias: D16)
#define PTC7_PORT                  C     //!< PTC7 Port name
#define PTC7_NUM                   7     //!< PTC7 Port number
#if SPI0_MISO_SEL == 4
#define SPI0_MISO_FN               2     //!< PTC7 Pin multiplexor for SPI
#define SPI0_MISO_GPIO             digitalIO_PTC7  //!< PTC7 = SPI
#endif
#if SPI0_MOSI_SEL == 4
#define SPI0_MOSI_FN               5     //!< PTC7 Pin multiplexor for SPI
#define SPI0_MOSI_GPIO             digitalIO_PTC7  //!< PTC7 = SPI
#endif

// PTC8 = TPM0_4,I2C0_SCL (Alias: D6)
#define PTC8_PORT                  C     //!< PTC8 Port name
#define PTC8_NUM                   8     //!< PTC8 Port number
#if TPM0_4_SEL == 1
#define PTC8_TPM_NUM               0     //!< PTC8 TPM number
#define PTC8_TPM_CH                4     //!< PTC8 TPM channel
#define PTC8_TPM_FN                3     //!< PTC8 Pin multiplexor for TPM
#endif
#if I2C0_SCL_SEL == 3
#define I2C0_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTC8  //!< PTC8 = I2C
#endif

// PTC9 = TPM0_5,I2C0_SDA (Alias: D7)
#define PTC9_PORT                  C     //!< PTC9 Port name
#define PTC9_NUM                   9     //!< PTC9 Port number
#if TPM0_5_SEL == 2
#define PTC9_TPM_NUM               0     //!< PTC9 TPM number
#define PTC9_TPM_CH                5     //!< PTC9 TPM channel
#define PTC9_TPM_FN                3     //!< PTC9 Pin multiplexor for TPM
#endif
#if I2C0_SDA_SEL == 3
#define I2C0_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTC9  //!< PTC9 = I2C
#endif

// PTC10 = I2C1_SCL (Alias: D22)
#define PTC10_PORT                 C     //!< PTC10 Port name
#define PTC10_NUM                  10    //!< PTC10 Port number
#if I2C1_SCL_SEL == 3
#define I2C1_SCL_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTC10  //!< PTC10 = I2C
#endif

// PTC11 = I2C1_SDA (Alias: D23)
#define PTC11_PORT                 C     //!< PTC11 Port name
#define PTC11_NUM                  11    //!< PTC11 Port number
#if I2C1_SDA_SEL == 3
#define I2C1_SDA_FN                2     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTC11  //!< PTC11 = I2C
#endif

// PTC12 (Alias: D24)
#define PTC12_PORT                 C     //!< PTC12 Port name
#define PTC12_NUM                  12    //!< PTC12 Port number

// PTC13 (Alias: D25)
#define PTC13_PORT                 C     //!< PTC13 Port name
#define PTC13_NUM                  13    //!< PTC13 Port number

// PTC16 (Alias: D26)
#define PTC16_PORT                 C     //!< PTC16 Port name
#define PTC16_NUM                  16    //!< PTC16 Port number

// PTC17 (Alias: D27)
#define PTC17_PORT                 C     //!< PTC17 Port name
#define PTC17_NUM                  17    //!< PTC17 Port number

// PTD0 = TPM0_0,SPI0_PCS0 (Alias: D10)
#define PTD0_PORT                  D     //!< PTD0 Port name
#define PTD0_NUM                   0     //!< PTD0 Port number
#if TPM0_0_SEL == 3
#define PTD0_TPM_NUM               0     //!< PTD0 TPM number
#define PTD0_TPM_CH                0     //!< PTD0 TPM channel
#define PTD0_TPM_FN                4     //!< PTD0 Pin multiplexor for TPM
#endif
#if SPI0_PCS0_SEL == 3
#define SPI0_PCS0_FN               2     //!< PTD0 Pin multiplexor for SPI
#define SPI0_PCS0_GPIO             digitalIO_PTD0  //!< PTD0 = SPI
#endif

// PTD1 = ADC0_5,TPM0_1,SPI0_SCK (Alias: D13)
#define PTD1_PORT                  D     //!< PTD1 Port name
#define PTD1_NUM                   1     //!< PTD1 Port number
#define PTD1_ADC_NUM               0     //!< PTD1 ADC number
#define PTD1_ADC_CH                5     //!< PTD1 ADC channel
#if TPM0_1_SEL == 3
#define PTD1_TPM_NUM               0     //!< PTD1 TPM number
#define PTD1_TPM_CH                1     //!< PTD1 TPM channel
#define PTD1_TPM_FN                4     //!< PTD1 Pin multiplexor for TPM
#endif
#if SPI0_SCK_SEL == 3
#define SPI0_SCK_FN                2     //!< PTD1 Pin multiplexor for SPI
#define SPI0_SCK_GPIO              digitalIO_PTD1  //!< PTD1 = SPI
#endif

