podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Packages/180.ARM_Peripherals/Project_Headers/PinMapping-MKL25Z4.h
// PTD2 = TPM0_2,SPI0_MOSI,SPI0_MISO (Alias: D11)
#define PTD2_PORT                  D     //!< PTD2 Port name
#define PTD2_NUM                   2     //!< PTD2 Port number
#if TPM0_2_SEL == 3
#define PTD2_TPM_NUM               0     //!< PTD2 TPM number
#define PTD2_TPM_CH                2     //!< PTD2 TPM channel
#define PTD2_TPM_FN                4     //!< PTD2 Pin multiplexor for TPM
#endif
#if SPI0_MOSI_SEL == 5
#define SPI0_MOSI_FN               2     //!< PTD2 Pin multiplexor for SPI
#define SPI0_MOSI_GPIO             digitalIO_PTD2  //!< PTD2 = SPI
#endif
#if SPI0_MISO_SEL == 5
#define SPI0_MISO_FN               5     //!< PTD2 Pin multiplexor for SPI
#define SPI0_MISO_GPIO             digitalIO_PTD2  //!< PTD2 = SPI
#endif

// PTD3 = TPM0_3,SPI0_MISO,SPI0_MOSI (Alias: D12)
#define PTD3_PORT                  D     //!< PTD3 Port name
#define PTD3_NUM                   3     //!< PTD3 Port number
#if TPM0_3_SEL == 2
#define PTD3_TPM_NUM               0     //!< PTD3 TPM number
#define PTD3_TPM_CH                3     //!< PTD3 TPM channel
#define PTD3_TPM_FN                4     //!< PTD3 Pin multiplexor for TPM
#endif
#if SPI0_MISO_SEL == 6
#define SPI0_MISO_FN               2     //!< PTD3 Pin multiplexor for SPI
#define SPI0_MISO_GPIO             digitalIO_PTD3  //!< PTD3 = SPI
#endif
#if SPI0_MOSI_SEL == 6
#define SPI0_MOSI_FN               5     //!< PTD3 Pin multiplexor for SPI
#define SPI0_MOSI_GPIO             digitalIO_PTD3  //!< PTD3 = SPI
#endif

// PTD4 = TPM0_4,SPI1_PCS0 (Alias: D2)
#define PTD4_PORT                  D     //!< PTD4 Port name
#define PTD4_NUM                   4     //!< PTD4 Port number
#if TPM0_4_SEL == 2
#define PTD4_TPM_NUM               0     //!< PTD4 TPM number
#define PTD4_TPM_CH                4     //!< PTD4 TPM channel
#define PTD4_TPM_FN                4     //!< PTD4 Pin multiplexor for TPM
#endif
#if SPI1_PCS0_SEL == 2
#define SPI1_PCS0_FN               2     //!< PTD4 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTD4  //!< PTD4 = SPI
#endif

// PTD5 = ADC0_6,TPM0_5,SPI1_SCK (Alias: D9)
#define PTD5_PORT                  D     //!< PTD5 Port name
#define PTD5_NUM                   5     //!< PTD5 Port number
#define PTD5_ADC_NUM               0     //!< PTD5 ADC number
#define PTD5_ADC_CH                6     //!< PTD5 ADC channel
#if TPM0_5_SEL == 3
#define PTD5_TPM_NUM               0     //!< PTD5 TPM number
#define PTD5_TPM_CH                5     //!< PTD5 TPM channel
#define PTD5_TPM_FN                4     //!< PTD5 Pin multiplexor for TPM
#endif
#if SPI1_SCK_SEL == 2
#define SPI1_SCK_FN                2     //!< PTD5 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTD5  //!< PTD5 = SPI
#endif

// PTD6 = ADC0_7,SPI1_MOSI,SPI1_MISO (Alias: D32)
#define PTD6_PORT                  D     //!< PTD6 Port name
#define PTD6_NUM                   6     //!< PTD6 Port number
#define PTD6_ADC_NUM               0     //!< PTD6 ADC number
#define PTD6_ADC_CH                7     //!< PTD6 ADC channel
#if SPI1_MOSI_SEL == 3
#define SPI1_MOSI_FN               2     //!< PTD6 Pin multiplexor for SPI
#define SPI1_MOSI_GPIO             digitalIO_PTD6  //!< PTD6 = SPI
#endif
#if SPI1_MISO_SEL == 3
#define SPI1_MISO_FN               5     //!< PTD6 Pin multiplexor for SPI
#define SPI1_MISO_GPIO             digitalIO_PTD6  //!< PTD6 = SPI
#endif

// PTD7 = SPI1_MISO,SPI1_MOSI (Alias: D33)
#define PTD7_PORT                  D     //!< PTD7 Port name
#define PTD7_NUM                   7     //!< PTD7 Port number
#if SPI1_MISO_SEL == 4
#define SPI1_MISO_FN               2     //!< PTD7 Pin multiplexor for SPI
#define SPI1_MISO_GPIO             digitalIO_PTD7  //!< PTD7 = SPI
#endif
#if SPI1_MOSI_SEL == 4
#define SPI1_MOSI_FN               5     //!< PTD7 Pin multiplexor for SPI
#define SPI1_MOSI_GPIO             digitalIO_PTD7  //!< PTD7 = SPI
#endif

// PTE0 = I2C1_SDA (Alias: D15)
#define PTE0_PORT                  E     //!< PTE0 Port name
#define PTE0_NUM                   0     //!< PTE0 Port number
#if I2C1_SDA_SEL == 4
#define I2C1_SDA_FN                6     //!< Pin multiplexor for I2C
#define I2C1_SDA_GPIO              digitalIO_PTE0  //!< PTE0 = I2C
#endif

// PTE1 = SPI1_MOSI,SPI1_MISO,I2C1_SCL (Alias: D14)
#define PTE1_PORT                  E     //!< PTE1 Port name
#define PTE1_NUM                   1     //!< PTE1 Port number
#if SPI1_MOSI_SEL == 5
#define SPI1_MOSI_FN               2     //!< PTE1 Pin multiplexor for SPI
#define SPI1_MOSI_GPIO             digitalIO_PTE1  //!< PTE1 = SPI
#endif
#if SPI1_MISO_SEL == 5
#define SPI1_MISO_FN               5     //!< PTE1 Pin multiplexor for SPI
#define SPI1_MISO_GPIO             digitalIO_PTE1  //!< PTE1 = SPI
#endif
#if I2C1_SCL_SEL == 4
#define I2C1_SCL_FN                6     //!< Pin multiplexor for I2C
#define I2C1_SCL_GPIO              digitalIO_PTE1  //!< PTE1 = I2C
#endif

// PTE2 = SPI1_SCK (Alias: A16)
#define PTE2_PORT                  E     //!< PTE2 Port name
#define PTE2_NUM                   2     //!< PTE2 Port number
#if SPI1_SCK_SEL == 3
#define SPI1_SCK_FN                2     //!< PTE2 Pin multiplexor for SPI
#define SPI1_SCK_GPIO              digitalIO_PTE2  //!< PTE2 = SPI
#endif

// PTE3 = SPI1_MISO,SPI1_MOSI (Alias: A15)
#define PTE3_PORT                  E     //!< PTE3 Port name
#define PTE3_NUM                   3     //!< PTE3 Port number
#if SPI1_MISO_SEL == 6
#define SPI1_MISO_FN               2     //!< PTE3 Pin multiplexor for SPI
#define SPI1_MISO_GPIO             digitalIO_PTE3  //!< PTE3 = SPI
#endif
#if SPI1_MOSI_SEL == 6
#define SPI1_MOSI_FN               5     //!< PTE3 Pin multiplexor for SPI
#define SPI1_MOSI_GPIO             digitalIO_PTE3  //!< PTE3 = SPI
#endif

// PTE4 = SPI1_PCS0 (Alias: A14)
#define PTE4_PORT                  E     //!< PTE4 Port name
#define PTE4_NUM                   4     //!< PTE4 Port number
#if SPI1_PCS0_SEL == 3
#define SPI1_PCS0_FN               2     //!< PTE4 Pin multiplexor for SPI
#define SPI1_PCS0_GPIO             digitalIO_PTE4  //!< PTE4 = SPI
#endif

// PTE5 (Alias: A13)
#define PTE5_PORT                  E     //!< PTE5 Port name
#define PTE5_NUM                   5     //!< PTE5 Port number

// PTE20 = ADC0_0,TPM1_0 (Alias: A11)
#define PTE20_PORT                 E     //!< PTE20 Port name
#define PTE20_NUM                  20    //!< PTE20 Port number
#define PTE20_ADC_NUM              0     //!< PTE20 ADC number
#define PTE20_ADC_CH               0     //!< PTE20 ADC channel
#if TPM1_0_SEL == 3
#define PTE20_TPM_NUM              1     //!< PTE20 TPM number
#define PTE20_TPM_CH               0     //!< PTE20 TPM channel
#define PTE20_TPM_FN               3     //!< PTE20 Pin multiplexor for TPM
#endif

// PTE21 = TPM1_1 (Alias: A10)
#define PTE21_PORT                 E     //!< PTE21 Port name
#define PTE21_NUM                  21    //!< PTE21 Port number
#if TPM1_1_SEL == 3
#define PTE21_TPM_NUM              1     //!< PTE21 TPM number
#define PTE21_TPM_CH               1     //!< PTE21 TPM channel
#define PTE21_TPM_FN               3     //!< PTE21 Pin multiplexor for TPM
#endif

// PTE22 = ADC0_3,TPM2_0 (Alias: A9)
#define PTE22_PORT                 E     //!< PTE22 Port name
#define PTE22_NUM                  22    //!< PTE22 Port number
#define PTE22_ADC_NUM              0     //!< PTE22 ADC number
#define PTE22_ADC_CH               3     //!< PTE22 ADC channel
#if TPM2_0_SEL == 4
#define PTE22_TPM_NUM              2     //!< PTE22 TPM number
#define PTE22_TPM_CH               0     //!< PTE22 TPM channel
#define PTE22_TPM_FN               3     //!< PTE22 Pin multiplexor for TPM
#endif

// PTE23 = TPM2_1 (Alias: A8)
#define PTE23_PORT                 E     //!< PTE23 Port name
#define PTE23_NUM                  23    //!< PTE23 Port number
#if TPM2_1_SEL == 4
#define PTE23_TPM_NUM              2     //!< PTE23 TPM number
#define PTE23_TPM_CH               1     //!< PTE23 TPM channel
#define PTE23_TPM_FN               3     //!< PTE23 Pin multiplexor for TPM
#endif

// PTE24 = TPM0_0,I2C0_SCL
#define PTE24_PORT                 E     //!< PTE24 Port name
#define PTE24_NUM                  24    //!< PTE24 Port number
#if TPM0_0_SEL == 4
#define PTE24_TPM_NUM              0     //!< PTE24 TPM number
#define PTE24_TPM_CH               0     //!< PTE24 TPM channel
#define PTE24_TPM_FN               3     //!< PTE24 Pin multiplexor for TPM
#endif
#if I2C0_SCL_SEL == 4
#define I2C0_SCL_FN                5     //!< Pin multiplexor for I2C
#define I2C0_SCL_GPIO              digitalIO_PTE24  //!< PTE24 = I2C
#endif

// PTE25 = TPM0_1,I2C0_SDA
#define PTE25_PORT                 E     //!< PTE25 Port name
#define PTE25_NUM                  25    //!< PTE25 Port number
#if TPM0_1_SEL == 4
#define PTE25_TPM_NUM              0     //!< PTE25 TPM number
#define PTE25_TPM_CH               1     //!< PTE25 TPM channel
#define PTE25_TPM_FN               3     //!< PTE25 Pin multiplexor for TPM
#endif
#if I2C0_SDA_SEL == 4
#define I2C0_SDA_FN                5     //!< Pin multiplexor for I2C
#define I2C0_SDA_GPIO              digitalIO_PTE25  //!< PTE25 = I2C
#endif

// PTE29 = ADC0_4,TPM0_2 (Alias: A7)
#define PTE29_PORT                 E     //!< PTE29 Port name
#define PTE29_NUM                  29    //!< PTE29 Port number
#define PTE29_ADC_NUM              0     //!< PTE29 ADC number
#define PTE29_ADC_CH               4     //!< PTE29 ADC channel
#if TPM0_2_SEL == 4
#define PTE29_TPM_NUM              0     //!< PTE29 TPM number
#define PTE29_TPM_CH               2     //!< PTE29 TPM channel
#define PTE29_TPM_FN               3     //!< PTE29 Pin multiplexor for TPM
#endif

// PTE30 = ADC0_23,TPM0_3 (Alias: A6)
#define PTE30_PORT                 E     //!< PTE30 Port name
#define PTE30_NUM                  30    //!< PTE30 Port number
#define PTE30_ADC_NUM              0     //!< PTE30 ADC number
#define PTE30_ADC_CH               23    //!< PTE30 ADC channel
#if TPM0_3_SEL == 3
#define PTE30_TPM_NUM              0     //!< PTE30 TPM number
#define PTE30_TPM_CH               3     //!< PTE30 TPM channel
#define PTE30_TPM_FN               3     //!< PTE30 Pin multiplexor for TPM
#endif

// PTE31 = TPM0_4 (Alias: D30)
#define PTE31_PORT                 E     //!< PTE31 Port name
#define PTE31_NUM                  31    //!< PTE31 Port number
#if TPM0_4_SEL == 3
#define PTE31_TPM_NUM              0     //!< PTE31 TPM number
#define PTE31_TPM_CH               4     //!< PTE31 TPM channel
#define PTE31_TPM_FN               3     //!< PTE31 Pin multiplexor for TPM
#endif

// </h>


#endif /* PINMAPPING_H_ */
